export default {
    chooseDate: 'انتخاب تاریخ',
    somebody: 'آرین علیخانی',
    home: 'خانه',
    news: 'اخبار',

    getCard: 'دریافت کارت',
    saveCard: 'ذخیره کارت',
    printCard: 'چاپ کارت',
    updatedAt: 'آخرین استعلام :date',
    savedAt: 'آخرین دانلود :date',
    aboutUs: 'درباره ما',
    myCards: 'کارت های من',
    loading: 'در حال بازیابی...',
    app: 'اهدای کارت',
    requestCard: 'درخواست کارت',
    myCard: 'کارت من',
    requestWithSsn: 'برای ادامه و دریافت کارت عضویت کد ملی خود را وارد نمایید:',
    registerCard: 'ثبت نام',
    codeMelliNotFound: 'کد ملی وجود ندارد',
    willYouRegister: 'آیا می خواهید ثبت نام کنید ؟',
    yes: 'بلی',
    no: 'خیر',
    choose: 'انتخاب',
    contactUs: 'تماس با‌ما',
    chooseIt: 'انتخاب کنید',
    cancel: 'برگشت',
    searchCard: 'استعلام کارت',
    noInternet: 'خطا در برقراری ارتباط...',
    share: 'به اشتراک بگذارید',
    webAddress: 'آدرس وبسایت',
    webAddressTemp: 'https://ehda.center',
    telephone: 'تلفن',
    telephoneTemp: '+982188190180',
    email: 'ایمیل',
    emailTemp: 'info@ehda.center',
    address: 'آدرس',
    addressTemp: 'تهران، خیابان ولیعصر، بعد از پل همت، روبروی خیابان دهم، ساختمان ۷۹۰، واحد ۱۲',

    shareMyBones: 'مایلم اعضای بدنم را پس از مرگم اهدا کنم.',
    shareMyBonesTitle: 'کارت اهدای عضو من',



    aboutText: 'کارت اهدای عضو یکی از بزرگترین نمادهای فرهنگی در زمینه ارتقای فرهنگ اهدای عضو می باشد. \n' +
    'از زمان راه اندازی واحدهای فراهم آوری اعضای پیوندی در کشورمان، مراکز مختلفی شروع به ثبت نام و صدور کارت اهدای عضو نمودند. در روزها و ماه‌های اول تعداد ثبت نام به بیش از 100 نفر در ماه نمیرسید، اما با شروع تبلیغات فرهنگی و برگزاری جشن نفس، تعداد بیشتری از مردم نیک اندیش سرزمینمان با این امر مقدس آشنا شدند و تعداد افراد متقاضی کارت اهدای عضو به بیش از 500 نفر در روز رسید... \n' +
    'تقاضای دریافت کارت اهدای عضو روز به روز بیشتر شد، به اندازه ای که مدت زمان دریافت کارت اهدای عضو برای هر فرد به بیش از 5ماه رسید. باتوجه به اینکه کارت اهدای عضو صرفاً نشان دهنده رضایت قلبی هر شخص برای اهدای عضو در زمان مرگ میباشد و جنبه‌‌ی قانونی ندارد؛ لذا بر آن شدیم تا سامانه ای راه اندازی کنیم که مدت زمان دریافت کارت را به طرز چشمگیری کاهش دهد تا انتظار رسیدن این کارت، مردم ایثارگر میهن عزیزمان را آزرده خاطر نسازد. \n' +
    'با توجه به مسائل فوق و همچنین پیرو تاکید مقام محترم وزارت بهداشت، درمان و آموزش پزشکی، ابداع روشی برای ثبت نام و صدور آنی کارت اهدای عضو در دستور کار این وزارت قرار گرفت و نتیجه تمامی بررسی ها، سامانه ای است که پیش روی شما می باشد. در این سامانه کد ملی هر فرد به صورت آنلاین کنترل شده و در صورتیکه اطلاعات مطابق کارت ملی وارد شده باشد، کارت اهدای عضو صادر شده و متقاضی میتواند همان لحظه کارت خود را ذخیره و چاپ نماید. \n' +
    'اطلاعات داوطلبین دریافت کارت بلافاصله وارد سامانه کشوری کارت اهدای عضو شده و در آن ذخیره می گردد. لازم به ذکر است این سامانه از طریق کلیه بیمارستانهای کشور قابل دسترسی بوده و امکان جستجوی نام افراد مرگ مغزی بستری در این بیمارستانها وجود دارد. \n' +
    'امید است با راه اندازی این سامانه قدمی هرچند کوچک برای ارتقای فرهنگ مقدس اهدی عضو و نجات جان بیماران نیازمند به پیوند اعضا برداریم... \n',


    saveCardDone: 'عکس کارت در گالری تلفن همراه ذخیره شد.',
    saveCardError: 'خطا در ذخیره سازی عکس.',


    downloadCardDone: 'دانلود کارت با موفقیت انجام شد.',
    downloadCardError: 'خطا در بازیابی کارت، مجددا تلاش نمایید.',

    printCardDone: 'چاپ کارت با موفقیت انجام شد.',
    printCardError: 'خطا در چاپ کارت، مجددا تلاش نمایید.',



    getCardDone: 'کارت با موفقیت دریافت شد.',
    getCardError: 'کاربر مورد نظر پیدا نشد.',

    registerCardDone: 'ثبت نام با موفقیت انجام شد.',
    registerCardError: 'ثبت نام انجام نشد.',


    searchCardDone: 'کارت پیدا شد، در حال انتقال شما به صفحه‌ی دریافت کارت هستیم.',
    searchCardError: 'کاربر مورد نظر پیدا نشد.',

    fields: {
        gender: 'جنسیت',
        tel_mobile: 'شماره تماس',
        name_first: 'نام',
        name_last: 'نام ‌خانوادگی',
        name_father: 'نام پدر',
        province: 'استان',
        home_city: 'شهر محل سکونت',
        male: 'مرد',
        female: 'زن',
        other: 'سایر',
        code_melli: 'کدملی',
        birth_date: 'تاریخ تولد',

    },

    genderTypes: [{
        id: 1,
        title: 'مرد'
    }, {
        id: 2,
        title: 'زن'
    }, {
        id: 3,
        title: 'سایر'
    }],
    errors: {
        '0': 'نام کاربری و گذرواژه دریافت نشده است.',
        '-1': 'نام کاربری یا گذرواژه اشتباه است.',
        '-2': 'کاربر API مجاز به انجام این درخواست نمی باشد.',
        '-3': 'نشانی IP تقاضادهنده، با نشانی ثبت‌شده در سامانه مطابقت ندارد.',
        '-4': 'سرور اهدای عضو قادر به ساخت درخواست نبوده است.',
        '-5': 'کد ملی دریافت نشده است.',
        '-6': 'مجددا تلاش نمایید.',
        '-7': 'درخواست شما منقضی شده است.',
        '-8': 'کد ملی معتبر نیست.',
        '-9': 'کد ملی ارسال‌شده مربوط به کاربری است که کارت اهدای عضو ندارد.',
        '-10': 'کاربر مورد نظر پیدا نشد.',
        '-11': 'یکی از پارامترهای ورودی دریافت کارت اهدای عضو به صورت صحیح به سرور نرسیده است.',
        '-12': 'تاریخ تولد یا تلفن همراه، با اطلاعات دارنده‌ی کارت اهدای عضو مطابقت ندارد.',
        '-13': 'مجددا تلاش نمایید.',
        '-14': 'کد استان دریافت نشده است یا مقدار صحیحی ندارد.',
        '-15': 'اعتبار یکی از پارامترهای ورودی ثبت نام کارت اهدای عضو تأیید نشد.',
        '-16': 'ثبت کارت اهدای عضو انجام نشد.',
        '-17': 'درخواست دریافت تنظیمات ناموفق بود.',
        '-18': 'درخواست دریافت تصاویر (slideshow) ناموفق بود.',
        '-19': 'درخواست دریافت سطوح تحصیلی ناموفق بود.',
        '-20': 'یکی از پارامترهای ورودی ثبت درخواست چاپ کارت به صورت صحبح به سرور نرسیده است.',
        '-21': 'ثبت درخواست چاپ کارت فیزیکی برای این کد ملی امکان‌پذیر نیست.',
        '-22': 'در پاسخ به متد درخواست فهرست رویدادها، اگر اطلاعاتی برای بازگرداندن وجود نداشته باشد این وضعیت برگشت داده خواهد شد.',
        '-23': 'امکان ثبت کارت اهدای عضو برای این کد ملی وجود ندارد. برای پیگیری با پشتیبانی تماس بگیرید.',
        '-24': 'اعتبار یکی از پارامترهای ورودی ویرایش کارت اهدای عضو تأیید نشد.',
        '-25': 'درخواست ویرایش کارت اهدای عضو ناموفق بود.',
        '-26': 'اعتبار یکی از پارامترهای ورودی بازیابی گذرواژه تأیید نشد.',
        '-96': 'مقدار وارد شده صحیح نیست.',
        '-97': 'شماره تماس صحیح نیست.',
        '-98': 'تاریخ تولد صحیح نیست.',
        '-99': 'خطا در بازیابی اطلاعات.'
    }
};